[Finnish]
Please connect the 2.4GHz USB dongle of the device to your computer's USB port for pairing. = Liitä laitteen 2,4 GHz:n USB-käyttöavain tietokoneen USB-porttiin pariuttamista varten.
Please follow the steps below for pairing. = Suorita pariutus seuraavasti.
1. Set the connection switch to the RF 2.4GHz mode. = 1. Aseta liitäntäkytkin RF 2,4 GHz -tilaan.
2. Press and hold the left button, right button and DPI button for 3 seconds. = 2. Pidä vasen-, oikea ja DPI-painiketta painettuna 3 sekuntia.
3. Click the "Pair" button on the interface. = 3. Napsauta liittymän ”Pariuta”  -painiketta.
1. Connect the device to your computer with the USB cable. = 1. Liitä laite tietokoneeseen USB-kaapelilla.
2. Click the "Pair" button on the interface. = 2. Napsauta liittymän ”Pariuta”  -painiketta.

Pair = Pariuta
Close = Sulje
Pairing = Pariutetaan
Pairing completed = Pariutus suoritettu loppuun
Pairing failed = Pariutus epäonnistui

1. Connect the headset with a USB cable and switch to 2.4GHz mode. = 1. Liitä laite tietokoneeseen USB-kaapelilla ja aseta yhteyskytkin 2,4 GHz: n RF-tilaan.
2. Press and hold the function button for 15 seconds until you hear the beep sounds. = 2. Pidä toimintopainiketta painettuna 15 sekunnin ajan, kunnes kuulet äänimerkkejä.
Please unplug and re-plug the 2.4 GHz receiver(dongle), power off the headset and then switch it to RF 2.4 GHz mode. = Irrota 2,4 GHz:n taajuusradiotaajuusvastaanotin ja aseta se takaisin. Sammuta laite ja kytke se sitten 2,4 GHz:n RF-tilaan.